CMZrasprojects/espScoop/Esp32_JSON_WebServer_v3/Esp32_JSON_WebServer_v3.ino
/**
 * @file      
 * @author    C.Moizeau
 * @license   
 * @copyright 
 * @date      
 *
 */
#include <Arduino.h>
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3,0,0)
#include <ETHClass2.h>       //Is to use the modified ETHClass
#define ETH  ETH2
#else
#include <ETH.h>
#endif
#include <SPI.h>
#include <SD.h>
#include "utilities.h"          //Board PinMap
#include <WiFi.h>
#include <WebServer.h>
#include <husarnet.h>
#include <ArduinoJson.h>
#include <sdConfigManager.h>
#include <ESP32Ping.h>
//#include <Wire.h>
#include "SSD1306Wire.h"


/* Définition des Variables globales :
*******************************************************************
*/
// Variables pour l'écran OLED
int currentLine = 0;
const int maxLines = 6;  // Nombre de lignes sur l'écran
const int maxLineWidth = 128; // Nombre de pixels max en largeur
const int lineHeight = 10;  // Hauteur d'une ligne en pixels

// Variables globales Network sauvegardées
const char* deviceName = "name";
bool ethernetStatus = 0;
bool ethernetDhcp = 1;
IPAddress ethernetIpv4(0, 0, 0, 0);
IPAddress ethernetMasque(0, 0, 0, 0);
IPAddress ethernetPasserelle(0, 0, 0, 0);
bool wifiStatus = 0;
bool wifiDhcp = 0;
IPAddress wifiIpv4(0, 0, 0, 0);
IPAddress wifiMasque(0, 0, 0, 0);
IPAddress wifiPasserelle(0, 0, 0, 0);
bool lteStatus = 0;

// Variables globales Audio sauvegardées
float headphoneLevel = 0;
unsigned int sampleRate = 0;

// Déclaration de la liste des connexions WiFi sauvegardées
std::vector<WifiCredentials> wifiList;

// Variables globales au lancement (non sauvegardées)
const char* wifiSsid = "none";
const char*  wifiPassword = "none";
String husarnetIpv6 = "0000:0000:0000:0000:0000:0000:0000:0000";

// Variables pour validation des connexions réseau :
//unsigned long startTime;
//bool husarnetConnected = false;
IPAddress googleIP(8, 8, 8, 8); // Adresse IP de Google DNS, fiable pour le test de connexion

/* Définition des "Class" utilisées :
*******************************************************************
*/

sdConfigManager config;
HusarnetClient Husarnet;
WebServer server(80);

// Initialize the OLED display using Arduino Wire:
SSD1306Wire display(0x3c, OLED_SDA, OLED_SCL);

/* Fonctions
*******************************************************************
*/





/* Fonction Setup    *****************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
*/

void setup() {

  Serial.begin(115200);

  Serial.println("Initialisation de l'écran OLED");
  ecranInit();

  Serial.println("Initialisation de la Carte SD");
  initSD();
  delay(500);

  Serial.println("Verification d'une demande factory reset");
  checkFactoryReset();

  Serial.println("Verification de la liste Wifi");
  for (const WifiCredentials& creds : wifiList) {
    Serial.print("SSID : ");
    Serial.println(creds.ssid);
    Serial.print("Mot de passe : ");
    Serial.println(creds.password);
  }

  Serial.println("Tentative de connexion au réseau");
  connectToWiFi();
  //connectToEthernet();

  // Attendre la réponse du ping avec une limite de 5 secondes
  if (waitForInternetConnection(5000)) {
    Serial.println("Internet est accessible !");
    connectToHusarnet();
  } else {
    Serial.println("Pas de connexion Internet.");
  }

  Serial.println("Paramétrages du server web");
  server.on("/", handleRoot);
  server.onNotFound(handleNotFound);
  server.on("/getStatus", HTTP_GET, getStatus);
  server.on("/setWiFiSettings", HTTP_POST, handleSetWiFiSettings);
  server.on("/setEthernetSettings", HTTP_POST, handleSetEthernetSettings);
  server.on("/setAudioSettings", HTTP_POST, handleSetAudioSettings);

  Serial.println("Démarrage du Server web");
  server.begin();

}
/* Fonction Loop
*************************************************************************************************************************************
*/

void loop() {

  server.handleClient(); // Permet de répondre aux requetes des clients (y compris 1ere connection !)
  delay(2);//allow the cpu to switch to other tasks

}
/* Fonctions avancées         ********************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
*/

