CMZrasprojects/espScoop/Esp32_JSON_WebServer_v3/Esp32_JSON_WebServer_v3.ino
// Fonctions pour envoyer les infos de connexions dans l'interface web lorsqu'un client les demande *********************
void getStatus()
{
    if (ETH.linkSpeed() != 0) { // CHANGER !!!!!!!!!!
      ethernetStatus = 1;
    } else {
      ethernetStatus = 0;
    }
    ethernetIpv4 = ETH.localIP();
    ethernetPasserelle = ETH.gatewayIP();
    ethernetMasque = ETH.subnetMask();

    wifiStatus = WiFi.isConnected();
    wifiIpv4 = WiFi.localIP();
    wifiPasserelle = WiFi.gatewayIP();
    wifiMasque = WiFi.subnetMask();
    wifiSsid = WiFi.SSID().c_str(); // Passage de String à const char* // Ca marche, mais j'arrive pas à le remettre en String après... Donc j'invoque WiFi.SSID() directement dans la reponse JSON
    husarnetIpv6 = Husarnet.getIpAddress().c_str(); //  ???????????????????!!!!!!!!!!!!!!!!!!!!!!!!! Ca marche !!!!!!!!!!!!!!!!!

    /* Conversion Data type vers String .............................
      bool: 
        String(variable); 
        String(variable ? "true" : "false");
      int, long, unsigned int, unsigned long :
        String(variable);
      float :
        String(variable);
        String(variable, 2);  // nombre de chiffres après la virgule
      char, [char], const char* :
        String(variable);
      IPAddress :
        variable.toString() 
      MOUAI..... Y'a des trucs bizarres avec les const char et/ou const char*
    */

    String jsonResponse = "{";
    jsonResponse += "\"deviceName\":\"" + String(deviceName) + "\",";
    jsonResponse += "\"ethernetStatus\":\"" + String(ethernetStatus) + "\",";
    jsonResponse += "\"ethernetDhcp\":\"" + String(ethernetDhcp) + "\",";
    jsonResponse += "\"ethernetIpv4\":\"" + ethernetIpv4.toString() + "\",";
    jsonResponse += "\"ethernetPasserelle\":\"" + ethernetPasserelle.toString() + "\",";
    jsonResponse += "\"ethernetMasque\":\"" + ethernetMasque.toString() + "\",";
    jsonResponse += "\"wifiStatus\":\"" + String(wifiStatus) + "\",";
    jsonResponse += "\"wifiDhcp\":\"" + String(wifiDhcp) + "\",";
    jsonResponse += "\"wifiIpv4\":\"" + wifiIpv4.toString() + "\",";
    jsonResponse += "\"wifiMasque\":\"" + wifiMasque.toString() + "\",";
    jsonResponse += "\"wifiPasserelle\":\"" + wifiPasserelle.toString() + "\",";
    jsonResponse += "\"wifiSsid\":\"" + WiFi.SSID() + "\",";
    jsonResponse += "\"husarnetIpv6\":\"" + husarnetIpv6 + "\",";
    jsonResponse += "\"sampleRate\":\"" + String(sampleRate) + "\",";
    jsonResponse += "\"headphoneLevel\":\"" + String(headphoneLevel) + "\"";
    
    jsonResponse += "}";

    server.send(200, "application/json", jsonResponse);
}
// Demande de modification des paramètres de connexions des flux AoIP
void handleSetConnexionSettings()
{
  ecran("Demande Client Web : Connexion Settings");
  server.send(200, "text/plain", "Connections settings updated");
  config.save("/config.json");
}
// Demande de modification des paramètres Audio
void handleSetAudioSettings()
{
  ecran("Demande Client Web : Audio Settings");
  sampleRate = server.arg("sampleRate").toInt();
  Serial.print("Nouvelle Frequence d'echantillonage après conversion .toInt() :");
  Serial.println(sampleRate);
  headphoneLevel = server.arg("headphoneLevel").toFloat();
  Serial.print("Nouveau volume casque :");
  Serial.println(headphoneLevel);

  server.send(200, "text/plain", "Audio settings updated");
  config.save("/config.json");

}
// Demande de modification de connexion au Wifi : Actif / SSID + Password / DHCP / IPs.  ************************************
void handleSetWiFiSettings()
{
  ecran("Demande Client Web : Wifi Settings");
  /* Conversions depuis des valeurs String récupérées depuis le client verx tous les datatype possibles :
  bool variableLocale = (server.arg("variableRecue") == "on"); ou bool variableLocale = (server.arg("variableRecue") == "1");
  int variableLocale = server.arg("variableRecue").toInt();
  float variableLocale = server.arg("variableRecue").toFloat();
  const char* variableLocale = (server.arg("variableRecue")).c_str();
  IPAddress variableLocale.fromString(server.arg("wifiIpv4"));

  Vaut mieux verifier que tout se passe bien, par exemple pour IPAddress :
  IPAddress variableLocale;  // si la variable n'a pas déjà été déclaré
  if (!variableLocale.fromString(server.arg("variableRecue"))) {
    // Gérer l'erreur
  }
  */
    wifiStatus = (server.arg("wifiStatus") == "on");  // Récupère l'état du Wi-Fi (on/off)   
    Serial.print("wifiStatus :");
    Serial.println(wifiStatus);  
    const char* newWifiSsid = (server.arg("newWifiSsid")).c_str();        // Récupère le SSID
    Serial.print("Nouveau SSID :");
    Serial.println(newWifiSsid);
    const char* newWifiPassword = (server.arg("newWifiPassword")).c_str(); // Récupère le mot de passe
    Serial.print("Nouveau Mot de passe :");
    Serial.println(newWifiPassword);
    wifiDhcp = (server.arg("wifiDhcp") == "on");      // Récupère l'état du DHCP sur Wi-Fi (on/off)
    Serial.print("wifiDhcp :");
    Serial.println(wifiDhcp);
    wifiIpv4.fromString(server.arg("wifiIpv4")); // Récupère l'ipv4 
    Serial.print("wifiIpv4 :");
    Serial.println(wifiIpv4);         
    wifiMasque.fromString(server.arg("wifiMasque"));      // Récupère le masque
    Serial.print("wifiMasque :");
    Serial.println(wifiMasque);
    wifiPasserelle.fromString(server.arg("wifiPasserelle")); // Récupère la passerelle
    Serial.print("wifiPasserelle :");
    Serial.println(wifiPasserelle);

    if (wifiStatus == 1) {
      if (wifiDhcp == 1){
        WiFi.disconnect(); // Déconnexion du Wi-Fi
        WiFi.begin(newWifiSsid, newWifiPassword); // Connexion au Wi-Fi
      } else  {
        WiFi.disconnect(); // Déconnexion du Wi-Fi
        WiFi.config(IPAddress(wifiIpv4), IPAddress(wifiPasserelle), IPAddress(wifiMasque), IPAddress(wifiPasserelle)); // On impose ipv4, passerelle, masque, dns1
        WiFi.begin(newWifiSsid, newWifiPassword); // Connexion au Wi-Fi
      }
    }

    server.send(200, "text/plain", "WiFi settings updated");
    config.save("/config.json");
}
void handleSetEthernetSettings()
{
  ecran("Demande Client Web : Ethernet Settings");
  /* Conversions depuis des valeurs String récupérées depuis le client verx tous les datatype possibles :
  bool variableLocale = (server.arg("variableRecue") == "on"); ou bool variableLocale = (server.arg("variableRecue") == "1");
  int variableLocale = server.arg("variableRecue").toInt();
  float variableLocale = server.arg("variableRecue").toFloat();
  const char* variableLocale = (server.arg("variableRecue")).c_str();
  IPAddress variableLocale.fromString(server.arg("wifiIpv4"));

  Vaut mieux verifier que tout se passe bien, par exemple pour IPAddress :
  IPAddress variableLocale;  // si la variable n'a pas déjà été déclaré
  if (!variableLocale.fromString(server.arg("variableRecue"))) {
    // Gérer l'erreur
  }
  */
    //ethernetStatus = (server.arg("ethernetStatus") == "on");  // Récupère l'état de l'ethernet (on/off)   
    //Serial.print("ethernetStatus :");
    //Serial.println(ethernetStatus);  
    ethernetDhcp = (server.arg("ethernetDhcp") == "on");      // Récupère l'état du DHCP de l'ethernet(on/off)
    Serial.print("ethernetDhcp :");
    Serial.println(ethernetDhcp);
    ethernetIpv4.fromString(server.arg("ethernetIpv4")); // Récupère l'ipv4 
    Serial.print("ethernetIpv4 :");
    Serial.println(ethernetIpv4);         
    ethernetMasque.fromString(server.arg("ethernetMasque"));      // Récupère le masque
    Serial.print("ethernetMasque :");
    Serial.println(ethernetMasque);
    ethernetPasserelle.fromString(server.arg("ethernetPasserelle")); // Récupère la passerelle
    Serial.print("ethernetPasserelle :");
    Serial.println(ethernetPasserelle);

    if (ethernetDhcp == 1){
      Serial.print("Ethernet : Configuration en DHCP");
      Serial.print("Valeur ethernetDhcp :");
      Serial.println(ethernetDhcp);
      ETH.config(IPAddress(0, 0, 0, 0));
    } else  {
      Serial.print("Valeur ethernetDhcp :");
      Serial.println(ethernetDhcp);
      Serial.print("Ethernet : Configuration en IP fixe");
      Serial.print("IPAddress(ethernetIpv4) :");
      Serial.println(IPAddress(ethernetIpv4));
      ETH.config(IPAddress(ethernetIpv4), IPAddress(ethernetPasserelle), IPAddress(ethernetMasque)); // On impose ipv4, passerelle, masque, dns1
    }
    ecran("Nouvelle adresse IP Eth :" + (ETH.localIP()).toString());
    server.send(200, "text/plain", "Ethernet settings updated");
    config.save("/config.json");
}
/* Fonctions de base : initialisation des modules :   ********************************************************************************
**************************************************************************************************************************************
**************************************************************************************************************************************
*/
// Initialisation et fonctions de l'ecran OLED  retour à la ligne automatique et gestion de débordement ******************************
void ecranInit() {
  // Initialising the UI will init the display too.
  display.init();
  display.clear();
  display.flipScreenVertically();
  display.setFont(ArialMT_Plain_10);
  ecran("Ecran Oled OK");
}
// Affichage complet :
void ecranFull() {
  display.clear();
  currentLine = 0;
  display.drawString(0, 0, "Hello world"); // (AlignementHorizontal, alignementVertical, "Texte...")

