CMZrasprojects/espScoop/Esp32_JSON_WebServer_v3/Esp32_JSON_WebServer_v3.ino
}
/* Affichage ligne par ligne ; Exemple d'utilisation :
Comprenant au choix texte et variable de n'importe quel type, dans n'importe quel ordre... + Renvoi à la ligne automatique (2 lignes max ???) :
  ecran("Valeur de ethernetIpv4 : " + ethernetIpv4.toString());
  ecran("Valeur de ethernetDhcp : " + String(ethernetDhcp));
*/
void ecran(const String& text) {
  int start = 0;
  String line = "";
  int linesNeeded = 0;  // Compteur de lignes nécessaires pour le texte restant

  // Calcul du nombre total de lignes nécessaires pour le texte
  for (int i = 0; i < text.length(); i++) {
    line += text[i];
    if (display.getStringWidth(line) >= maxLineWidth) {
      linesNeeded++;
      line = "";
    }
  }
  // Ajoute une ligne si un reste de texte n'atteignant pas maxLineWidth est présent
  if (line.length() > 0) linesNeeded++;

  // Si le texte nécessite plus de lignes que disponibles, efface l'écran et recommence en haut
  if (linesNeeded > (maxLines - currentLine)) {
    display.clear();
    currentLine = 0;
  }

  // Réinitialisation pour l'affichage réel, avec retour à la ligne
  line = "";
  for (int i = 0; i < text.length(); i++) {
    char c = text[i];
    line += c;
    int lineWidth = display.getStringWidth(line);

    // Affiche la ligne si elle atteint la largeur maximale
    if (lineWidth >= maxLineWidth) {
      display.setTextAlignment(TEXT_ALIGN_LEFT);
      display.drawString(0, currentLine * lineHeight, line);
      display.display();

      currentLine++;
      if (currentLine >= maxLines) {
        display.clear();
        currentLine = 0;
      }
      line = "";  // Réinitialise la ligne pour les caractères restants
    }
  }

  // Affiche le reste du texte s'il en reste après la dernière ligne complète
  if (line.length() > 0) {
    display.setTextAlignment(TEXT_ALIGN_LEFT);
    display.drawString(0, currentLine * lineHeight, line);
    display.display();
    currentLine++;

    if (currentLine >= maxLines) {
      display.clear();
      currentLine = 0;
    }
  }
}

// Initialisation de la carte SD  ***************************************************************************************
void initSD() 
{
  pinMode(SD_MISO_PIN, INPUT_PULLUP);
  SPI.begin(SD_SCLK_PIN, SD_MISO_PIN, SD_MOSI_PIN, SD_CS_PIN);
  if (!SD.begin(SD_CS_PIN)) {
      ecran("Erreur de Carte SD");
      Serial.println("Erreur de montage de la carte SD");
  } else {
      ecran("Carte SD OK");
      Serial.printf("Carte SD OK, taille: %uMB\n", SD.cardSize() / (1024 * 1024));
  }
}

// Fonction de réinitialisation des paramètres aux réglages usine  stockés dans default_config.json ***********************
void checkFactoryReset() {

  // Attente initiale pour détecter un appui long au démarrage
  unsigned long startWaitTime = millis();

  const int factoryResetPin = 46; // Pin du bouton pour le reset usine
  const unsigned long resetDelay = 5000;  // Durée (en ms) d'appui pour déclencher le reset
  bool factoryResetTriggered = false;

  // Variable pour mesurer la durée d'appui
  unsigned long pressStartTime = 0;
  bool buttonPressed = false;

  pinMode(factoryResetPin, INPUT_PULLUP);

  // Boucle d'attente (ex. 500 ms) pour voir si un appui est détecté
  while (millis() - startWaitTime < 500) {
    // On vérifie si le bouton est enfoncé
    if (digitalRead(factoryResetPin) == LOW) {  // Bouton appuyé
      ecran("Appui long détecté...");
      Serial.println("Appui long détecté au démarrage. Maintenez pour le reset usine...");
      pressStartTime = millis();  // Enregistre l'heure d'appui
      buttonPressed = true;

      // Boucle d'attente tant que le bouton est maintenu
      while (digitalRead(factoryResetPin) == LOW) {
        if (millis() - pressStartTime >= resetDelay) {
          factoryResetTriggered = true;  // Reset confirmé après l'appui long
          break;
        }
      }

      // Vérifie si l'appui long a bien été maintenu pour déclencher le reset usine
      if (factoryResetTriggered) {
        ecran("Reset en cours...");
        Serial.println("Appui long validé. Lancement du Factory reset en cours...");
        if (config.resetToDefault("/default_config.json", "/config.json")) {
          ecran("Reset OK");
          Serial.println("Reset usine effectué. Configuration par défaut restaurée depuis default_config.json.");
        } else {
          Serial.println("Erreur lors du reset usine.");
        }
      } else {
        Serial.println("Appui long non maintenu. Chargement de la configuration depuis config.json.");
        if (!config.load("/config.json")) {
          Serial.println("Erreur de chargement de la configuration, chargement des valeurs par défaut.");
        } else {
          ecran("Config OK");
          Serial.println("Fin de la sequence reset");
        }
      }
      // On sort de la fonction après le reset
      return;
    }
  }
  // Si aucun appui n'est détecté au démarrage, charger la configuration normalement
  ecran("Chargement config...");
  Serial.println("Aucun appui détecté. Chargement de la dernière configuration depuis config.json.");
  if (!config.load("/config.json")) {
    Serial.println("Erreur de chargement de la configuration, chargement des valeurs par défaut.");
  } else {
    ecran("Config OK");
    Serial.println("Fin de la séquence reset");
  }
}
// Fonction pour démarrer le port Ethernet
void connectToEthernet(){
  // Si on est en DHCP, on renseigne l'ipv4 avec 0.0.0.0
  if (ethernetDhcp == 1) {
      Serial.println("Ethernet : Configuration en DHCP");
      ETH.config(IPAddress(0, 0, 0, 0));
  } else {
      Serial.println("Ethernet : Configuration en IP fixe");
      Serial.print("ethernetIpv4 :");
      Serial.println(ethernetIpv4);
      Serial.print("IPAddress(ethernetIpv4) :");
      Serial.println(IPAddress(ethernetIpv4));
      ETH.config(IPAddress(ethernetIpv4), IPAddress(ethernetPasserelle), IPAddress(ethernetMasque));
  }
#if CONFIG_IDF_TARGET_ESP32
    if (!ETH.begin(ETH_TYPE, ETH_ADDR, ETH_MDC_PIN,
                   ETH_MDIO_PIN, ETH_RESET_PIN, ETH_CLK_MODE)) {
        Serial.println("ETH start Failed!");
    }
#else
    if (!ETH.begin(ETH_PHY_W5500, 1, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
                   SPI3_HOST,
                   ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN)) {
        Serial.println("ETH start Failed!");
    }
    else {
      Serial.println("Module Ethernet W5500 chargé");
      ecran("Ethernet OK :" + (ETH.localIP()).toString());
    }
#endif

  if (ETH.config(IPAddress(ethernetIpv4), IPAddress(ethernetPasserelle), IPAddress(ethernetMasque)) == false) {
    Serial.println("Configuration failed.");
  }


