CMZrasprojects/espScoop/Esp32_JSON_WebServer_v3/Esp32_JSON_WebServer_v3.ino
}

// Fonction pour se connecter au Wi-Fi en fonction des réseaux sauvegardés dans wifiList.  *************************
void connectToWiFi() {
    WiFi.mode(WIFI_STA);
    // Scanner les réseaux Wi-Fi disponibles
    int numNetworks = WiFi.scanNetworks();
    Serial.println("Scan terminé");

    // Parcourir les réseaux détectés
    for (int i = 0; i < numNetworks; i++) {
        const char* ssid = WiFi.SSID(i).c_str();  // Récupérer le SSID du réseau détecté
        Serial.print("Récupération du ssid du réseau le plus puissant : ");
        Serial.println(ssid);

        // Parcourir la liste wifiList et chercher un réseau avec le même SSID
        for (const WifiCredentials& creds : wifiList) {
              if (strcmp(ssid, creds.ssid) == 0) {  // Comparaison des chaînes C
                Serial.printf("Connexion au réseau WiFi le plus puissant : %s\n", ssid);
                Serial.printf("Avec ce mot de passe : %s\n", creds.password);
                WiFi.begin(ssid, creds.password); // Utiliser directement creds.password
                int tries = 0;

                // Attendre que la connexion soit établie
                while (WiFi.status() != WL_CONNECTED && tries < 20) {
                    delay(500);
                    Serial.print(".");
                    tries++;
                }

                // Vérifier si la connexion est réussie
                if (WiFi.status() == WL_CONNECTED) {
                    Serial.println("");
                    Serial.print("Connecté au Wi-Fi : ");
                    Serial.println(ssid);
                    Serial.print("Adresse IP : ");
                    Serial.println(WiFi.localIP());
                    ecran("Connexion Wifi OK :" + (WiFi.localIP()).toString());
                    return;  // Connexion réussie, sortir de la fonction
                } else {
                    Serial.println("Échec de la connexion.");
                }
            }
        }
    }

    // Si aucun réseau connu n'est trouvé, afficher un message
    Serial.println("Aucun réseau connu trouvé. Tentative de connexion échouée.");
}
// Vérifier la connexion à Internet avant de lancer husarnet en pingant Google !     ***********************
bool waitForInternetConnection(unsigned long timeout) {
    unsigned long startTime = millis();
    Serial.println("Vérification de la connexion Internet...");

    // Boucle pour vérifier plusieurs fois jusqu'au timeout
    while ((millis() - startTime) < timeout) {
        if (Ping.ping(googleIP)) {
            ecran("Connexion Internet OK");
            return true;  // Connexion réussie
        }
        delay(500);  // Attendre avant de retenter (pour éviter de spammer le ping)
    }
    ecran("Pas de connexion Internet !");
    return false;  // Timeout atteint sans réponse du ping
}
// Fonction d'initialisation et connexion à Husarnet ********************************************************
void connectToHusarnet()
{
  // Joindre Husarnet, avec une petite attente pour l'initialisation
  // delay(1000);  // délai d'attente avant la tentative de connexion
  Husarnet.join(deviceName, "fc94:b01d:1803:8dd8:b293:5c7d:7639:932a/iN4FhatGTppdpqNWQ4DS3M");
  ecran("Connexion à Husarnet...");

  while (!Husarnet.isJoined()) {
    Serial.println("En attente de la connexion au réseau Husarnet...");
    delay(2000);  // vérifier toutes les secondes
  }

  if (Husarnet.isJoined()) {
    Serial.println("Connexion au réseau Husarnet réussie !");
    ecran("Connexion Husarnet active !");
    ecran("Taper http://" + String(deviceName));
    Serial.print("Husarnet IP: ");
    Serial.println(Husarnet.getIpAddress().c_str());
    husarnetIpv6 = Husarnet.getIpAddress().c_str();
  } else {
    Serial.println("Échec de connexion au réseau Husarnet après plusieurs tentatives.");
    // Ajouter ici une gestion d'erreur si nécessaire
  }
}

// Fonction pour démarrer le webServer à partir du fichier index.html sur la carte SD.  *************************
void handleRoot()
{
  ecran("Un client Web connecté !");
  File file = SD.open("/index.html");
  if (file) {
    server.streamFile(file, "text/html");
    file.close();
  } else {
    server.send(404, "text/plain", "File Not Found");
  }
}
// Fonction pour renvoyer au client un message d'erreur lorsque la requête ne peut être remplie.  ****************
void handleNotFound()
{
    ecran("Erreur de requete HTTP");
    String message = "File Not Found\n\n";
    message += "URI: ";
    message += server.uri();
    message += "\nMethod: ";
    message += (server.method() == HTTP_GET) ? "GET" : "POST";
    message += "\nArguments: ";
    message += server.args();
    message += "\n";
    for (uint8_t i = 0; i < server.args(); i++) {
        message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
    }
    server.send(404, "text/plain", message);
}

/* ***************************************************************
******************************************************************
******************************************************************
******************************************************************
*/
/*
    Dans le setup, placer : startConnectionCycle();

void loop() {
    // Vérifie si la connexion Husarnet est active, sinon relance le cycle de connexion
    if (husarnetConnected && !isNetworkConnected()) {
        Serial.println("Connexion perdue, relance du cycle de connexion...");
        husarnetConnected = false;
        startConnectionCycle();
    }
}

void startConnectionCycle() {
    while (!husarnetConnected) {
        if (tryEthernetConnection()) {
            connectToHusarnet();
        } else if (tryWifiConnection()) {
            connectToHusarnet();
        } else {
            Serial.println("Aucune connexion établie, nouvelle tentative dans 15 secondes...");
            delay(15000);
        }
    }
}

bool tryEthernetConnection() {
    Serial.println("Tentative de connexion Ethernet...");
    startTime = millis();
    connectToEthernet();

    while (millis() - startTime < 3000) {
        if (isEthernetConnected()) {
            Serial.println("Connexion Ethernet réussie");
            return true;
        }
    }
    Serial.println("Échec de la connexion Ethernet, tentative de connexion Wi-Fi...");
    return false;
}

bool tryWifiConnection() {
    Serial.println("Tentative de connexion Wi-Fi...");
    connectToWifi();
    startTime = millis();

    while (millis() - startTime < 3000) {
        if (isWifiConnected()) {
            Serial.println("Connexion Wi-Fi réussie");
            return true;
        }
    }
    Serial.println("Échec de la connexion Wi-Fi");
    return false;
}

void connectToHusarnet() {
    Serial.println("Connexion à Husarnet...");
    connectToHusarnet();
    startTime = millis();

    while (millis() - startTime < 5000) {
        if (isHusarnetConnected()) {
            Serial.println("Connexion Husarnet réussie");
            husarnetConnected = true;
            return;
        }
    }
    Serial.println("Échec de la connexion Husarnet");
}

// Fonctions d'état pour vérifier les connexions
bool isEthernetConnected() {
    // Vérifiez l'état de la connexion Ethernet ici
}

bool isWifiConnected() {
    // Vérifiez l'état de la connexion Wi-Fi ici
}

bool isHusarnetConnected() {
    // Vérifiez l'état de la connexion Husarnet ici
}

bool isNetworkConnected() {
    return isEthernetConnected() || isWifiConnected();
}
*/